In [78]:
import bokeh
import numpy as np
import pandas as pd
import sqlite3


def db_connect():
    conn = sqlite3.connect('output/sales_new_seed.db')
    return conn

def get_col_names():
    
    col_names = []
    
    with db_connect() as conn:
        c = conn.cursor()
        c.execute('PRAGMA table_info(sales)')
        for col in c.fetchall():
            col_names.append(col[1])
    return col_names

def db_query(query):
    
    query_dict = []
    
    with db_connect() as conn:
        c = conn.cursor()
        c.execute(query)
        
        rows = c.fetchall()
        for row in rows:
            query_dict.append(row)
            
        return query_dict
            

sales_col_names = get_col_names()
ten_rows = db_query('SELECT * FROM sales LIMIT 20')

ten_rows_frame = pd.DataFrame(data=ten_rows, columns=sales_col_names)
ten_rows_frame

,sale_id,sale_date,store_id,item_id,bottles_sold,sale_value,sale_vol_ml
0,S29198800001,2015-11-20,2191,297,6,16284,4500
1,S29195400002,2015-11-21,2205,297,12,32568,9000
2,S29050300001,2015-11-16,3549,249,2,1920,300
3,S28867700001,2015-11-04,2513,237,3,16002,5250
4,S29050800001,2015-11-17,3942,249,2,1920,300
5,S28869200001,2015-11-11,3650,237,1,5334,1750
6,S28865700001,2015-11-09,2538,238,6,10458,9000
7,S28869500001,2015-11-10,3942,237,2,10668,3500
8,S29339300091,2015-11-30,2662,173,4,11748,3000
9,S29050900001,2015-11-16,4307,249,2,1920,300
10,S29049900001,2015-11-17,2661,249,20,19200,3000
11,S28868200001,2015-11-05,2561,237,2,10668,3500
12,S28869600001,2015-11-09,4114,237,3,16002,5250
13,S28866900001,2015-11-11,3650,238,1,1743,1500
14,S29050100001,2015-11-19,2806,249,20,19200,3000
15,S29049600001,2015-11-17,2624,249,20,19200,3000
16,S28868400001,2015-11-04,2572,237,3,16002,5250
17,S29196300002,2015-11-24,2595,297,6,16284,4500
18,S29134300126,2015-11-18,3723,258,1,14850,6000
19,S28869000001,2015-11-10,2665,237,2,10668,3500